using Microsoft.EntityFrameworkCore.Migrations;

namespace Dbt.Geomed.Migrations
{
    public partial class LoadServices : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData("Services",
        new[] { "ServiceClass", "Part", "Subpart", "Group", "Subgroup", "Name" },
        new[,] {
{"A", "01", "01", "001", null,            "Сбор анамнеза и жалоб в дерматологии"},
{"A", "01", "01", "001", "001",           "Сбор анамнеза и жалоб при термических, химических и электрических ожогах"},
{"A", "01", "01", "002", null,            "Визуальное исследование в дерматологии"},
{"A", "01", "01", "002", "001",           "Визуальное исследование при термических, химических и электрических ожогах"},
{"A", "01", "01", "003", null,            "Пальпация в дерматологии"},
{"A", "01", "01", "003", "001",           "Пальпация при термических, химических и электрических ожогах"},
{"A", "01", "01", "004", null,            "Сбор анамнеза и жалоб в косметологии"},
{"A", "01", "01", "005", null,            "Определение дермографизма"},
{"A", "01", "02", "001", null,            "Сбор анамнеза и жалоб при заболеваниях мышц"},
{"A", "01", "02", "002", null,            "Визуальное исследование мышц"},
{"A", "01", "02", "003", null,            "Пальпация мышц"},
{"A", "01", "03", "001", null,            "Сбор анамнеза и жалоб при патологии костной системы"},
{"A", "01", "03", "002", null,            "Визуальное исследование костной системы"},
{"A", "01", "03", "003", null,            "Пальпация костной системы"},
{"A", "01", "03", "004", null,            "Перкуссия костной системы"},
{"A", "01", "04", "001", null,            "Сбор анамнеза и жалоб при патологии суставов"},
{"A", "01", "04", "002", null,            "Визуальное исследование суставов"},
{"A", "01", "04", "003", null,            "Пальпация суставов"},
{"A", "01", "04", "004", null,            "Перкуссия суставов"},
{"A", "01", "05", "001", null,            "Сбор анамнеза и жалоб при заболеваниях системы крови"}}
        );
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
