using Microsoft.EntityFrameworkCore.Migrations;

namespace Dbt.Geomed.Migrations
{
    public partial class LoadCategories : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData("Services",
new[] { "ServiceClass", "Part", "Subpart", "Group", "Subgroup", "Name" },
new[,] {

{ "A", "02", "26", "002", null, "Исследование сред глаза в проходящем свете"},
{ "A", "02", "26", "003", null, "Офтальмоскопия"},
{ "A", "02", "26", "004", null, "Визометрия"},
{ "A", "02", "26", "005", null, "Периметрия"},
{ "A", "02", "26", "006", null, "Кампиметрия"},
{ "A", "02", "26", "007", null, "Механофосфен"},
{ "A", "02", "26", "008", null, "Скотометрия (тест Амслера-Маринчева)"},
{ "A", "02", "26", "009", null, "Исследование цветоощущения по полихроматическим таблицам"},
{ "A", "03", "16", "001", "002",    "Эзофагогастродуоденоскопия со стимуляцией желчеотделения"},
{ "A", "03", "16", "001", "003",    "Эзофагогастродуоденоскопия флюоресцентная"},
{ "A", "03", "16", "002",  null,    "Установка назоинтестинального зонда"},
{ "A", "03", "17", "001",  null,    "Эзофагогастроинтестиноскопия"},
{ "A", "03", "18", "001",  null,    "Толстокишечная эндоскопия"},
{ "A", "03", "18", "001", "001",    "Толстокишечная видеоэндоскопия"},
{ "A", "04", "12", "014", null, "Дуплексное сканирование сосудов гепатобиллиарной зоны"},
{ "A", "04", "12", "015", null, "Триплексное сканирование вен"},
{ "A", "04", "12", "016", null, "Исследование ночной пенильной тумесценции"},
{ "A", "04", "12", "017", null, "Дуплексное сканирование сосудов щитовидной железы"},
{ "A", "04", "12", "018", null, "Дуплексное сканирование транскраниальное артерий и вен"}

}
        );


            migrationBuilder.InsertData("Categories",
new[] { "Code", "Name" },
new[,] {
{"01", "функциональное обследование без использования приспособлений и/или приборов и выполняемое непосредственно медицинскими работниками (физикальные исследования, включая сбор жалоб, анамнеза, перкуссию, пальпацию и аускультацию)"},
{"02", "функциональное обследование с использованием простых приспособлений, приборов, не требующее специальных навыков и помощи ассистента"},
{"03", "визуальное обследование, требующее специальных приборов, навыков и помощи ассистента"},
{"04", "регистрация звуковых сигналов, издаваемых или отражающихся органами или тканями с их последующей расшифровкой и описанием"}
}
        );


        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
